#الحلقات For Loops
#تستخدم الحلقات للتكرار عبر تسلسل (مثل قائمة أو سلسلة نصية) أو أي كائن قابل للتكرار (مثل مجموعة أو قاموس).
#يمكن استخدام الحلقات للتكرار عبر قوائمم، سلاسل نصية، مجموعات، قواميس، وغيرها من الكائنات القابلة للتكرار.
#الصيغة العامة للحلقة for هي:
for letter in "Python":
    print(letter)
#في هذا المثال، تتكرر الحلقة عبر كل حرف في السلسلة النصية "Python" وتطبع كل حرف على سطر جديد.
buddies = ["Ahmed", "Ali", "Mohamed"]
for friend in buddies:
   
    print(friend)
#في هذا المثال، تتكرر الحلقة عبر قائمة الأصدقاء وتطبع كل اسم على سطر جديد.


for index in range(10):
    if index % 2 == 0:
        print(index,"is an even number")
    else:
        print(index,"is an odd number")
#يمكن استخدام الدالة range() لتوليد سلسلة من الأعداد. في هذا المثال، تتكرر الحلقة عبر الأعداد من 0 إلى 9 وتحدد ما إذا كان كل عدد زوجيًا أو فرديًا.