# تعريف الدالة 1 
#ملاحظة: في بايثون، يتم تعريف الدوال باستخدام الكلمة المفتاحية def، تليها اسم الدالة وأقواس تحتوي على أي معلمات (إن وجدت). يجب أن يكون جسم الدالة متداخلاً (indented) تحت تعريف الدالة. يمكن استدعاء الدالة عن طريق كتابة اسمها متبوعًا بأقواس. إذا كانت الدالة تحتوي على معلمات، يتم تمرير القيم داخل الأقواس عند الاستدعاء.
#مثال على تعريف واستدعاء


#def say_hi():
#def say_hi(name, age):
  #  print("Hello " + name + ", How are you  your age is"+ age)
#say_hi("Hamza", " 23 ")

#function with return value 2 

#ملاحظة: الدوال في بايثون يمكن أن تعيد قيمة باستخدام الكلمة المفتاحية return. عند استدعاء الدالة، يمكن تخزين القيمة المعادة في متغير أو استخدامها مباشرة.

def cube(number):
    return number * number * number
#print(cube(3))
#ملاحظ يمكن تخزين القيمة المعادة في متغير
result = cube(4)
print(result)

#دالة مع اكثر من قيمة معادة 3
def sub (num1,num2):
    return num1 - num2
print(sub(7,4))